#!/bin/bash
: << "DOC"
Linux: Домашнее задание 15 (Python)
Работаем в Fabrice Bellard jslinux или на учебном сервере в Вашей директории в папке opt:

Создайте скрипт sleeper.sh, который будет 10 раз с интервалом в 5 секунд 
писать дату в формате HH:MM:SS и количество процессов одним числом.
Уменьшите или уберите временной интервал (который нам дает sleep), используя vi или nano, закомментировав строку или поменяв значение sleep
С помощью скрипта запишите в файл информацию о процессоре. 
С помощью скрипта запишите в файл информацию об операционной системе, но отфильтруйте информацию так, чтобы 
осталось только имя (NAME=Alpine Linux) - или другое имя, если работаете на сервере.
Выполните прошлое действие, но так, чтобы слово NAME= не осталось, а было только имя в чистом виде (Alpine)
С помощью скрипта создайте 50 файлов с расширением txt и именами от 50.txt до 100.txt
Пришлите файл скрипта

Вот что вам понадобится для реализации всего этого: 
sleep
touch
ps -ef
date +“%H:%M:%S”
cat /etc/os-release
grep   
awk ‘{print$НОМЕР_СТОЛБЦА}’
cat /proc/cpuinfo
Если удобно, то вот однострочник, создающий простейший скрипт, который надо будет редактировать: 
echo -e `#!/bin/bash\n date\n echo “it works!“` > /tmp/script.sh

DOC

for i in {1..10}
do
  date +"%H:%M:%S"
  ps -ef | wc -l
#  sleep 5
done

cat /proc/cpuinfo > info.txt
cat /etc/os-release | grep -w "NAME" >> info.txt
cat /etc/os-release | grep -w "NAME" | awk -F '"' '{print $2}' | awk '{print $1}' >> info.txt

for i in {50..100}
do
  touch "/tmp/${i}.txt"
done


